-- Побудуйте колонку різниці в роках.
-- Для оригінальної або нормованої таблиці для колонки Year побудуйте з використанням 
-- вбудованих SQL-функцій:
-- атрибут, що створює дату першого січня відповідного року,
-- Наприклад, якщо атрибут містить значення '1996', то значення нового атрибута має бути '1996-01-01'.
-- атрибут, що дорівнює поточній даті,
-- атрибут, що дорівнює різниці в роках двох вищезгаданих колонок.
-- Перераховувати всі інші атрибути, такі як Number_malaria, не потрібно.
SELECT 
STR_TO_DATE(CONCAT(ic.year, '-01-01'), '%Y-%m-%d') as original_date,
CURDATE() as cur_date,
TIMESTAMPDIFF(YEAR, STR_TO_DATE(CONCAT(ic.year, '-01-01'), '%Y-%m-%d'), CURDATE()) as years_diff
FROM infectious_cases;
